[
  {
    "id": "malacca-congestion",
    "name": "Malacca Strait Congestion Zone",
    "polygon": [
      [99.0, 4.5],
      [100.0, 3.5],
      [101.0, 2.5],
      [102.0, 1.8],
      [103.0, 1.0],
      [104.2, 1.0],
      [104.5, 1.5],
      [103.8, 2.2],
      [102.8, 2.8],
      [101.8, 3.5],
      [100.8, 4.2],
      [99.8, 5.0],
      [99.0, 4.5]
    ],
    "narrative": "The Malacca Strait handles 25-28% of global seaborne trade, with over 90,000 vessel transits annually creating severe congestion bottlenecks. Average waiting times have increased 40% since 2020, with insurance premiums for vessels in this zone rising 12-18% due to collision risk and piracy concerns. A single blockage event here would disrupt $3.4 billion in daily trade flows.",
    "color": [255, 100, 50, 50]
  },
  {
    "id": "scs-corridor",
    "name": "South China Sea Corridor",
    "polygon": [
      [105.0, 2.0],
      [108.0, 2.0],
      [112.0, 5.0],
      [116.0, 8.0],
      [118.0, 12.0],
      [118.0, 16.0],
      [116.0, 20.0],
      [114.0, 22.0],
      [112.0, 20.0],
      [110.0, 16.0],
      [108.0, 12.0],
      [107.0, 8.0],
      [106.0, 5.0],
      [105.0, 2.0]
    ],
    "narrative": "The South China Sea corridor facilitates an estimated $5.3 trillion in annual trade, representing roughly one-third of global maritime commerce. Overlapping territorial claims by six nations create persistent geopolitical risk, with military incidents increasing 35% since 2021. Shipping firms report 5-8% insurance surcharges and growing demand for alternative routing through the Lombok and Makassar straits.",
    "color": [100, 150, 255, 40]
  },
  {
    "id": "nickel-belt",
    "name": "Indonesia Nickel Belt",
    "polygon": [
      [120.0, -1.0],
      [121.5, -1.5],
      [123.5, -2.0],
      [125.0, -2.5],
      [126.5, -2.0],
      [128.0, -2.5],
      [128.5, -3.5],
      [127.5, -4.5],
      [125.5, -4.5],
      [123.5, -4.0],
      [121.5, -3.5],
      [120.0, -2.5],
      [120.0, -1.0]
    ],
    "narrative": "Indonesia controls approximately 48% of global nickel reserves, with major processing hubs in Morowali and Konawe on Sulawesi's eastern coast. The 2020 raw ore export ban has catalyzed $30+ billion in downstream smelting and EV battery investment, primarily from Chinese firms. This zone is now the single most critical node in the global electric vehicle supply chain, with nickel matte exports growing 25% year-over-year.",
    "color": [255, 180, 0, 50]
  },
  {
    "id": "js-sez",
    "name": "Johor-Singapore SEZ",
    "polygon": [
      [103.4, 1.55],
      [104.1, 1.55],
      [104.1, 1.2],
      [103.95, 1.15],
      [103.7, 1.15],
      [103.4, 1.2],
      [103.4, 1.55]
    ],
    "narrative": "The Johor-Singapore Special Economic Zone, announced in January 2025, represents a $100+ billion development pipeline designed to create a seamless cross-border economic corridor. The SEZ targets semiconductor manufacturing, data centers, and financial services, leveraging Singapore's infrastructure with Malaysia's competitive labor costs. Early projections indicate 150,000+ new jobs and a 20% increase in bilateral trade within five years.",
    "color": [0, 255, 180, 50]
  }
]
