{
  "clients": [
    {
      "id": "petronas",
      "name": "Petronas",
      "sector": "Energy",
      "country": "Malaysia",
      "exposure": { "energyCosts": 2, "shipping": 4, "sanctions": 3, "refinancing": 3 },
      "scenarioImpacts": {
        "base": "Lower Brent ($72/bbl) compresses upstream EBITDA vs prior year; US$6bn bond completed cushions near-term liquidity. MYR strength (+6% vs 90d avg) reduces ringgit-denominated cost base.",
        "stress": "Oil spike to $82/bbl partially offsets earlier revenue compression; shipping cost increases manageable given SCS base-case open-lane assumption. Credit spreads on 2027 USD bonds widen 30–40bp.",
        "tail": "SCS SLOC closure forces LNG offtake rerouting; est. $160M incremental logistics cost. Brent spike toward $100 would partially offset; covenant risk on 2030 USD bond series warrants review."
      },
      "talkingPoints": [
        "Completed US$6bn bond offering (refinancing + general corporate) — no near-term USD maturity pressure; focus shifts to optimizing swap book vs declining Brent curve.",
        "JPMorgan forecasts Brent at $60 avg for 2026 and ABN AMRO at $58 for Q1 — upstream EBITDA trajectory warrants hedging extension beyond current 2026 swap book.",
        "MYR at 3.8925 (significantly stronger than 90d avg of 4.38) creates favorable window to convert USD receivables; consider accelerating FX conversion schedule."
      ]
    },
    {
      "id": "ptt",
      "name": "PTT Group",
      "sector": "Energy",
      "country": "Thailand",
      "exposure": { "energyCosts": 2, "shipping": 3, "sanctions": 2, "refinancing": 5 },
      "scenarioImpacts": {
        "base": "JKM LNG at $9.58/MMBtu (down ~40% from $15.8 prior year) delivers substantial import cost relief — est. $18–22M/month saving vs prior year baseline. THB at 30.99 (significantly stronger) reduces USD-denominated debt service burden.",
        "stress": "Spot LNG procurement at JKM +$3/MMBtu adds ~$27M/quarter cost; still materially below prior-year levels. THB could weaken toward 33–34 in stress, reversing FX tailwind.",
        "tail": "Emergency LNG procurement required as ASEAN spot market tightens; JKM could spike 55% from $9.58 base. THB depreciation adds to USD-denominated debt service in extreme scenario."
      },
      "talkingPoints": [
        "JKM LNG at $9.58 vs $15.8 prior year represents ~40% cost relief for PTT's import book — urgency of floating-to-fixed hedging is reduced; recommend reassessing hedge ratio at current forward curve.",
        "THB 20bn domestic bond maturing Q3 2026 — BOT accommodative stance and THB strength at 30.99 creates favorable pre-financing window; act before potential stress scenario reversal.",
        "BOT cutting rates (TH 10Y at 2.82%) supports domestic refinancing cost; opportunity to lock in lower fixed-rate domestic funding for infrastructure capex."
      ]
    },
    {
      "id": "pertamina",
      "name": "Pertamina",
      "sector": "Energy",
      "country": "Indonesia",
      "exposure": { "energyCosts": 4, "shipping": 6, "sanctions": 4, "refinancing": 8 },
      "scenarioImpacts": {
        "base": "US$500M 1.4% USD bond matured Feb 9 2026 — refinancing needed into higher-rate environment. IDR at 16,820 (weakening, +5% vs 90d avg) increases USD debt service costs across $4.2bn USD bond book.",
        "stress": "IDR hits 17,500–18,000 vs USD; USD debt service ratio deteriorates materially. Shipping lane disruption adds $30–40M/quarter. Spread widening on any new issuance likely 60–80bp above current iTraxx IG.",
        "tail": "Sovereign backstop tested; USD bond spreads blow out 200bp+. IDR at 19,000+ would severely stress debt service coverage ratio. Cross-default clause in 2028 Sukuk warrants immediate legal review."
      },
      "talkingPoints": [
        "US$500M 1.4% bond matured Feb 9 2026 — Pertamina needs fresh USD issuance; current iTraxx Asia IG at 102bp still offers an executable window before any further spread widening. Recommend USD 750M–1bn 5Y benchmark.",
        "IDR at 16,820 and weakening: $4.2bn USD bond portfolio has no FX hedge — each 500 IDR move = ~$125M incremental annual cost. Cross-currency swap program should be prioritized.",
        "BI cutting cycle (ID 10Y at 6.92%) supports domestic IDR bond issuance as diversification vs USD book; consider a 2–3 year IDR sukuk to reduce USD concentration risk."
      ]
    },
    {
      "id": "seatrium",
      "name": "Seatrium Limited",
      "sector": "Marine & Offshore Engineering",
      "country": "Singapore",
      "exposure": { "energyCosts": 4, "shipping": 8, "sanctions": 3, "refinancing": 4 },
      "scenarioImpacts": {
        "base": "Post-merger integration of Sembcorp Marine and Keppel Offshore & Marine creates enlarged order book with improved yard utilization. SGD at 1.2663 (strong) reduces USD-denominated input costs.",
        "stress": "Yard utilization disrupted by SCS escalation; 3–4 vessel deliveries delayed; war risk insurance costs spike. Offshore energy capex clients may defer orders if Brent falls toward $60.",
        "tail": "SCS-based contracts halted; combined entity revenue at risk from deferred FPSO and rig deliveries. Liquidity covenant on SGD revolving credit facility warrants review."
      },
      "talkingPoints": [
        "Seatrium (post-Sembcorp Marine / Keppel O&M merger) has enlarged SGD 800M+ revolving credit facility renewal due — consolidation creates opportunity to upsize and extend; recommend mandate banks before Q2.",
        "Falling Brent toward $60 (JPM 2026 forecast) risks offshore E&P capex deferrals — Seatrium order book concentration in offshore drilling assets needs scenario stress-test.",
        "War risk insurance premiums elevated — explore captive structure or parametric insurance for SCS-exposed vessel delivery schedule; coordinate with client's risk management team."
      ]
    },
    {
      "id": "dbs",
      "name": "DBS Bank",
      "sector": "Banking",
      "country": "Singapore",
      "exposure": { "energyCosts": 2, "shipping": 3, "sanctions": 6, "refinancing": 3 },
      "scenarioImpacts": {
        "base": "ASEAN corporate loan book performing; NIM under modest pressure as BI and BSP cutting cycles reduce floating-rate loan yields. Sanctions compliance cost elevated given OFAC shadow fleet actions.",
        "stress": "Energy and shipping NPL ratio rises 25–30bp; provisions increase $100–130M. Phoenix Ship Management FZE-linked exposures require immediate counterparty review.",
        "tail": "Systemic EM credit stress; loan loss provisions double; CET1 buffer tested. SGD safe-haven status limits systemic contagion but regional subsidiary stress likely."
      },
      "talkingPoints": [
        "OFAC designated Phoenix Ship Management FZE (UAE) and 29 shadow fleet vessels in late 2025 — sanctions screening refresh required across correspondent banking and trade finance portfolios.",
        "BI and BSP cutting cycles compress floating-rate NIM; DBS should assess duration extension on bond portfolio to offset NIM headwind — opportunity to lead Pertamina or Petronas fixed-rate issuance.",
        "Opportunity to lead Pertamina USD benchmark bond (post Feb 9 maturity) — DBS's ASEAN distribution network well-positioned; coordinate with DCM on timeline."
      ]
    },
    {
      "id": "ocbc",
      "name": "OCBC",
      "sector": "Banking",
      "country": "Singapore",
      "exposure": { "energyCosts": 2, "shipping": 4, "sanctions": 5, "refinancing": 3 },
      "scenarioImpacts": {
        "base": "Greater China and ASEAN trade finance revenue stable; fee income resilient. MYR and THB strength benefits Malaysian and Thai subsidiary balance sheets.",
        "stress": "Trade finance volumes drop 10–15% on SCS route disruption; shipping client provisions rise. OFAC secondary sanctions warning increases compliance cost on ASEAN correspondent relationships.",
        "tail": "Commodity trade finance book stressed; Greater China corridor disrupted. Wing Hang Bank exposure creates China-risk correlation in extreme scenario."
      },
      "talkingPoints": [
        "OFAC Nov 2025 action targeting ASEAN financial intermediaries in Iranian petrochemical trade — OCBC's correspondent banking review should cover any Malaysia/Singapore-domiciled commodity traders with Iranian exposure.",
        "Trade finance structuring opportunity for Petronas LNG offtake novation — OCBC well-positioned given Malaysia relationship; explore letter of credit facilities for new buyer syndicate.",
        "MYR at 3.8925 (significantly stronger) benefits OCBC's Malaysian operations — consider accelerating repatriation of MYR profits before potential reversal."
      ]
    },
    {
      "id": "bangkok-bank",
      "name": "Bangkok Bank",
      "sector": "Banking",
      "country": "Thailand",
      "exposure": { "energyCosts": 3, "shipping": 4, "sanctions": 3, "refinancing": 5 },
      "scenarioImpacts": {
        "base": "Thai corporate sector resilient; THB at 30.99 (strongest in 90d range) reduces USD borrower stress. BOT cutting cycle (TH 10Y at 2.82%) supports domestic loan demand but compresses NIM.",
        "stress": "Energy sector NPLs rise modestly; THB could weaken toward 33–34 in stress, stressing USD borrowers. PTT-linked supply chain exposure requires monitoring.",
        "tail": "Systemic Thai banking stress; FIDF intervention likely. THB depreciation toward 37+ would severely stress USD-denominated corporate borrowers in Bangkok Bank's book."
      },
      "talkingPoints": [
        "THB at 30.99 — well within comfortable range for Bangkok Bank's USD borrower base; however BOT cutting (TH 10Y at 2.82%) compresses NIM, creating incentive to extend asset duration. Review investment portfolio positioning.",
        "PTT's LNG cost relief (~40% YoY) reduces energy sector NPL risk in base case — update credit watch list and communicate to credit committee that PTT scenario has improved materially.",
        "USD funding mix (est. 28% of liabilities) at historically favorable FX levels — window to term out short-dated USD funding at current THB/USD rate before any stress-driven reversal."
      ]
    },
    {
      "id": "maybank",
      "name": "Maybank",
      "sector": "Banking",
      "country": "Malaysia",
      "exposure": { "energyCosts": 3, "shipping": 4, "sanctions": 4, "refinancing": 4 },
      "scenarioImpacts": {
        "base": "MYR at 3.8925 (materially stronger than 90d avg of 4.38) benefits Maybank's USD-denominated borrowers and reduces cross-border capital strain. Petronas relationship supports Malaysian credit quality.",
        "stress": "Indonesian and Philippine subsidiaries face local currency stress (IDR already weakening at 16,820). ASEAN HY composite spreads at 388bp signal emerging stress in Maybank's regional credit book.",
        "tail": "Regional banking contagion; Maybank's ASEAN footprint becomes a liability as IDR, PHP, and potentially MYR weaken simultaneously. AT1 spreads likely to gap wider."
      },
      "talkingPoints": [
        "MYR at 3.8925 is significantly stronger than 90d average of 4.38 — Maybank's Malaysian operations benefit; recommend accelerating MYR-denominated AT1 issuance at current favorable level before any reversal.",
        "IDR weakening (16,820 and trending) creates stress for Maybank's Indonesian subsidiary book — review USD-borrower NPL watch list; cross-border capital allocation may need adjustment.",
        "Petronas US$6bn bond completed with Petronas relationship intact — Maybank should position for any Petronas Islamic financing or sukuk mandate in H2 2026."
      ]
    },
    {
      "id": "apl",
      "name": "APL / CMA CGM SG",
      "sector": "Shipping",
      "country": "Singapore",
      "exposure": { "energyCosts": 7, "shipping": 9, "sanctions": 5, "refinancing": 4 },
      "scenarioImpacts": {
        "base": "SCS routes operating normally under current Heightened level; freight rates recovering (Regional Shipping index +6.2% vs 90d avg). Bunker fuel costs easing with Brent at $72 vs $89 in prior year.",
        "stress": "Rerouting adds 8–12 days per voyage; vessel utilization drops 15–20%. War risk insurance premiums spike; SCS-specific policy riders not standard in current fleet policies.",
        "tail": "SCS closure forces Cape of Good Hope routing; est. $380–420M incremental annual cost. OFAC shadow fleet vessel designations increase port clearance risk in certain Asian hubs."
      },
      "talkingPoints": [
        "Bunker fuel hedging opportunity: Brent at $72 and declining (JPM $60 forecast) — extend hedging program now to lock in lower bunker costs; current 40% hedge ratio leaves significant exposure unhedged for H2 2026.",
        "OFAC designated 29 shadow fleet vessels including NEBULA DRIFT and AETHER SAIL — SCS route due diligence now includes vessel identity screening; confirm fleet AIS compliance protocols with operations team.",
        "Freight rate recovery (Regional Shipping index +6.2% vs 90d avg) creates favorable window for sale-and-leaseback on aging Panamax vessels to optimize fleet composition and release liquidity."
      ]
    }
  ]
}
